
# Напишете програма, която да пресмята колко литра боя е нужна за боядисването на къща.
# Като за стените се използва зелена боя, а за покрива – червена.
# Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2.

# Стените имат следните размери:

# ⦁	Предната и задната стена са квадрати със страна „x“
# ⦁	на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
#  Страничните стени са правоъгълници със страни „x“ и „y“
# ⦁	и на двете странични стени има по един квадратен прозорец със страна 1.5м

# Покривът има следните размери:

# ⦁	Два правоъгълника със страни „x“ и „y“
# ⦁	Два равностранни триъгълника със страна „x“ и височина „h“
# Трябва да пресметнете площта на всички страни и площта на покрива, за да
# намерите колко литра от всяка боя ще са нужни.

# От конзолата се четат 3 реда:
# ⦁	x – височината на къщата – реално число в интервала
# ⦁	y – дължината на страничната стена – реално число в интервала
# ⦁	h – височината на триъгълната стена на прокрива – реално число в интервала
# Да се отпечатат на конзолата две числа всяко на нов ред:
# ⦁	Литрите зелена боя
# ⦁	Литрите червена боя
# Форматирани до вторият знак след десетичната запетая.

x = float(input())
y = float(input())
h = float(input())

back_wall = x * x
front_wall = (x * x) - (1.2 * 2)
side_wall = ((x * y) * 2) - ((1.5 * 1.5) * 2)

roof_one = (x * y) * 2
roof_two = (x * h / 2) * 2

walls = back_wall + front_wall + side_wall
roof = roof_one + roof_two

green_paint = walls / 3.4
red_paint = roof / 4.3

print(f"{green_paint:.2f}")
print(f"{red_paint:.2f}")
