
# Най-малкият син на семейство Иванови все още не знае таблицата за умножение.
# Веднага след коледните празници, той ще има контролно и вие трябва да му помогнете да я научи.
# Вашата задача е да съставите програма, в която се въвежда цяло трицифрено число и
# се извежда таблицата за умножение. Поради особености на Вашата програма,
# тя взима цифрите на въведеното число в обратен ред.
# Максималната стойност на множителите е определена от всяка една от 3-те цифри на въведеното число.

# Входът е цяло трицифрено число в интервала [111…999].

# Да се отпечатат на конзолата няколко на брой реда в следния формат:
# "{първата цифра} * {втората цифра} * {третата цифра} = {резултатът от умножението на трите цифри};"
# Първата, втората и третата цифра не могат да бъдат отрицателни числа или равни на 0!

number = int(input())

digit_1 = number % 10
digit_2 = (number // 10) % 10
digit_3 = ((number // 10) // 10) % 10

for number_1 in range(1, digit_1 + 1):
    for number_2 in range(1, digit_2 + 1):
        for number_3 in range(1, digit_3 + 1):
            print(f"{number_1} * {number_2} * {number_3} = {number_1 * number_2 * number_3};")
