
# Г-жа Иванова иска да отслабне след празниците.
# Започвайки тренировка, първия ден тя пробягва М километра.
# Следващите N дни, тя увеличава дневната си норма с К%.
# За да успее да отслабне, тя трябва да избяга минимум 1000 км.
# Съставете програма, която при получени начални километри, брой дни и проценти,
# с които тя ще увеличава всеки ден нормата си, ще проверява дали километрите,
# които тя е избягала са достатъчни. Ако километрите не са достатъчни,
# на конзолата да се изведат недостигащите километри.
# Ако са достатъчни да се изведе съобщение в което г-жа Иванова е
# поздравена за добре свършената работа.

# От конзолата се четат поредица от числа, всяко на отделен ред:
# На първия ред – N – брой дни, в които г-жа Иванова тренира  – цяло число в интервала [1...50]
# На втория ред – M – километрите, които е избягала първия ден – реално число в интервала [1.00…500.00]
# За всеки един ден на отделен ред :
# Процентите, с които се увеличава дневната си норма – цяло число в интервала [1…100]

# Да се отпечата на конзолата 1 ред, както следва:
# Ако пробяганите километри са >= 1000 км – да се отпечатва съобщение:
# "You've done a great job running {избяганите километри повече от 1000} more   kilometers!"
#  Ако пробяганите километри са < 1000 км – да се отпечата съобщение:
# "Sorry Mrs. Ivanova, you need to run {недостигащите километри} more kilometers"
# Резултатът да се форматира до по-голямото цяло число.

import math

days_training = int(input())
km_day_one = float(input())

km_ran_daily = km_day_one
km_ran = km_day_one

for _ in range(days_training):
    increase_km_to_run = int(input()) / 100
    km_ran_daily += (km_ran_daily * increase_km_to_run)
    km_ran += km_ran_daily


if km_ran >= 1000:
    print(f"You've done a great job running {math.ceil(km_ran - 1000)} more kilometers!")
else:
    print(f"Sorry Mrs. Ivanova, you need to run {math.ceil(1000 - km_ran)} more kilometers")
