
# Дадени са n цели числа в интервала [1…1000].
# От тях някакъв процент p1 са под 200,
# друг процент p2 са от 200 до 399,
# друг процент p3 са от 400 до 599,
# друг процент p4 са от 600 до 799
# и останалите p5 процента са от 800 нагоре.
# Да се напише програма, която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.
# Пример:
# имаме n = 20 числа: 53, 7, 56, 180, 450, 920, 12, 7, 150, 250, 680, 2, 600, 200, 800, 799, 199, 46, 128, 65.
# Получаваме следното разпределение и визуализация:
# Диапазон	   Числа в диапазона	                      Брой числа	         Процент
#  < 200	53, 7, 56, 180, 12, 7, 150, 2, 199, 46, 128, 65	  12	   p1 = 12 / 20 * 100 = 60.00%
# 200 … 399	        250, 200	                               2	    p2 = 2 / 20 * 100 = 10.00%
# 400 … 599	           450	                                   1	    p3 = 1 / 20 * 100 = 5.00%
# 600 … 799	      680, 600, 799                            	   3	    p4 = 3 / 20 * 100 = 15.00%
# ≥ 800	             920, 800	                               2	    p5 = 2 / 20 * 100 = 10.00%

# На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа.
# На следващите n реда стои по едно цяло число – числата върху които да бъде изчислена хистограмата.

# Да се отпечата на конзолата хистограмата – 5 реда,
# всеки от които съдържа число между 0% и 100%,
# с точност две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.

how_many = int(input())

p1 = 0
p2 = 0
p3 = 0
p4 = 0
p5 = 0

for _ in range(how_many):
    numbers = int(input())
    if numbers < 200:
        p1 += 1
    elif numbers <= 399:
        p2 += 1
    elif numbers <= 599:
        p3 += 1
    elif numbers <= 799:
        p4 += 1
    else:
        p5 += 1

amount = p1 + p2 + p3 + p4 + p5

print(f"{((p1 / amount) * 100):.2f}%")
print(f"{((p2 / amount) * 100):.2f}%")
print(f"{((p3 / amount) * 100):.2f}%")
print(f"{((p4 / amount) * 100):.2f}%")
print(f"{((p5 / amount) * 100):.2f}%")
