
# Шеф на компания забелязва че все повече служители прекарват  време в сайтове, които ги разсейват.
# За да предотврати това, той въвежда изненадващи проверки на отворените табове на браузъра на служителите си.
# Според отворения сайт в таба се налагат следните глоби:
# ⦁	"Facebook" -> 150 лв.
# ⦁	"Instagram" -> 100 лв.
# ⦁	"Reddit" -> 50 лв.
# От конзолата се четат два реда:
# ⦁	Брой отворени табове в браузъра n - цяло число в интервала [1...10]
# ⦁	Заплата - число в интервала [500...1500]
# След това n – на брой пъти се чете име на уебсайт – текст
# Изход
# ⦁	Ако по време на проверката заплатата стане по-малка или равна на 0 лева, на конзолата се изписва
# "You have lost your salary." и програмата приключва.
# ⦁	В противен случай след проверката на конзолата се изписва остатъкът от заплатата (да се изпише като цяло число).

tabs_open = int(input())
salary = int(input())

fine = 0

for _ in range(tabs_open):
    the_site = input().lower()
    if the_site == "facebook":
        fine += 150
    elif the_site == "instagram":
        fine += 100
    elif the_site == "reddit":
        fine += 50
    
    if fine >= salary:
        print("You have lost your salary.")
        exit()

print(salary - fine)
