
# Поканени сте от академията да напишете софтуер,
# който да пресмята точките за актьор/актриса.
# Академията ще ви даде първоначални точки за актьора.
# След това всеки оценяващ ще дава своята оценка.
# Точките, които актьора получава се формират от:
# дължината на името на оценяващия умножено по точките, които дава делено на две.
# Ако резултатът в някой момент надхвърли 1250.5 програмата трябва да прекъсне и да се отпечата,
# че дадения актьор е получил номинация.

# ⦁	Име на актьора - текст
# ⦁	Точки от академията - реално число в интервала [2.0... 450.5]
# ⦁	Брой оценяващи n - цяло число в интервала[1… 20]
# На следващите n-на брой реда:
# ⦁	Име на оценяващия - текст
# ⦁	Точки от оценяващия - реално число в интервала [1.0... 50.0]

# Да се отпечата на конзолата един ред:
# ⦁	Ако точките са над 1250.5:
# "Congratulations, {име на актьора} got a nominee for leading role with {точки}!"
# ⦁	Ако точките не са достатъчни:
# 	"Sorry, {име на актьора} you need {нужни точки} more!"
# Резултатът да се форматирана до първата цифра след десетичния знак!

actor = input()
points_from_academy = float(input())
number_judges = int(input())

points = points_from_academy

for _ in range(number_judges):
    judge = input()
    point_judge = float(input())
    final_points_judges = (len(judge) * point_judge) / 2
    points += final_points_judges
    diff = 1250.5 - points

if points > 1250.5:
    print(f"Congratulations, {actor} got a nominee for leading role with {points:.1f}!")
else:
    print(f"Sorry, {actor} you need {diff:.1f} more!")
