
# Катерачи от цяла България се събират на групи и набелязват следващите върхове за изкачване.
# Според размера на групата, катерачите ще изкачват различни върхове.
# ⦁	Група до 5 човека – изкачват Мусала
# ⦁	Група от 6 до 12 човека – изкачват Монблан
# ⦁	Група от 13 до 25 човека – изкачват Килиманджаро
# ⦁	Група от 26 до 40 човека –  изкачват К2
# ⦁	Група от 41 или повече човека – изкачват Еверест
# Да се напише програма, която изчислява процента на катерачите изкачващи всеки връх.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# ⦁	На първия ред – броя на групите от катерачи – цяло число в интервала [1...1000]
# ⦁	За всяка една група на отделен ред – броя на хората в групата – цяло число в интервала [1...1000]
# Изход
# Да се отпечатат на конзолата 5 реда,
# всеки от които съдържа процент между 0.00% и 100.00% с точност до втората цифра след десетичната запетая.
# ⦁	Първи ред - процентът изкачващи Мусала
# ⦁	Втори ред – процентът изкачващи Монблан
# ⦁	Трети ред – процентът изкачващи Килиманджаро
# ⦁	Четвърти ред – процентът изкачващи К2
# ⦁	Пети ред – процентът изкачващи Еверест

groups = int(input())

people = 0
peak_musala = 0
peak_monblan = 0
peak_kilmanjaro = 0
peak_k2 = 0
peak_everest = 0

for _ in range(groups):
    people_in_group = int(input())
    people += people_in_group

    if people_in_group <= 5:
        peak_musala += people_in_group
    elif 6 <= people_in_group <= 12:
        peak_monblan += people_in_group
    elif 13 <= people_in_group <= 25:
        peak_kilmanjaro += people_in_group
    elif 26 <= people_in_group <= 40:
        peak_k2 +=people_in_group
    elif people_in_group >= 41:
        peak_everest += people_in_group

print(f"{(peak_musala / people * 100):.2f}%")
print(f"{(peak_monblan / people * 100):.2f}%")
print(f"{(peak_kilmanjaro / people * 100):.2f}%")
print(f"{(peak_k2 / people * 100):.2f}%")
print(f"{(peak_everest / people * 100):.2f}%")
