
# Курсът "Train the trainers" е към края си и финалното оценяване наближава.
# Вашата задача е да помогнете на журито, което ще оценява презентациите,
# като напишете програма, в която да изчислява средната оценка от
# представянето на всяка една презентация от даден студент, а накрая -
# средния успех от всички тях.
# От конзолата на първият ред се прочита броят на хората в журито n - цяло число.
# След това на отделен ред се прочита името на презентацията – текст.
# За всяка една презентация на нов ред се четат n - на брой оценки - реално число.
# След изчисляване на средната оценка за конкретна презентация, на конзолата се печата:
#  "{името на презентацията} - {средна оценка}."
# След получаване на команда "Finish", на конзолата се печата
# "Student's final assessment is {среден успех от всички презентации}."
# и програмата приключва.
# Всички оценки трябва да бъдат форматирани до втория знак след десетичната запетая.

jury = int(input())
presentation_name = input()

all_grades = 0
all_grades_mid = 0

while presentation_name != "Finish":

    grade_sum = 0
    grades = 0

    for _ in range(jury):
        grade = float(input())
        grade_sum += grade
        grades += 1

    print(f"{presentation_name} - {(grade_sum / grades):.2f}.")

    all_grades += 1
    all_grades_mid += grade_sum / grades

    presentation_name = input()

print(f"Student's final assessment is {(all_grades_mid / all_grades):.2f}.")
