
# Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа.
# На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число.
# Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е намерено.

# Входът се чете от конзолата и се състои от три реда:
# ⦁	Първи ред – начало на интервала – цяло число в интервала [1...999]
# ⦁	Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
# ⦁	Трети ред – магическото число – цяло число в интервала [1...10000]

# На конзолата трябва да се отпечата един ред, според резултата:
# ⦁	Ако е намерена комбинация чиито сбор на числата е равен на магическото число
# ⦁	"Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
# ⦁	Ако не е намерена комбинация отговаряща на условието
# ⦁	"{броят на всички комбинации} combinations - neither equals {магическото число}"

number_one = int(input())
number_two = int(input())
magic_number = int(input())

counter = 0

for x in range(number_one, number_two + 1):
    for y in range(number_one, number_two + 1):
        counter += 1
        if x + y == magic_number:
            print(f"Combination N:{counter} ({x} + {y} = {magic_number})")
            exit()

print(f"{counter} combinations - neither equals {magic_number}")
