
# Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред),
# като са изпълнени следните условия:
# ⦁	На всеки четен етаж има само офиси;
# ⦁	На всеки нечетен етаж има само апартаменти;

# ⦁	Всеки апартамент се означава по следния начин :
# А{номер на етажа}{номер на апартамента},
# номерата на апартаментите започват от 0;

# ⦁	Всеки офис се означава по следния начин :
# О{номер на етажа}{номер на офиса},
# номерата на офисите също започват от 0;

# ⦁	На последният етаж винаги има апартаменти и те са по-големи от останалите,
# затова пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
# От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.

stories = int(input())
apartments = int(input())

for x in range(stories, 0, -1):
    for y in range(0, apartments):

        if x == stories:
            print(f"L{x}{y}", end=" ")

        elif x % 2 == 0:
            print(f"O{x}{y}", end=" ")
        else:
            print(f"A{x}{y}", end=" ")
    print(end="\n")
