
# Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата,
# описани по-долу. Да се напише програма, която пресмята бонус точките,
# които получава числото и общия брой точки (числото + бонуса).
# ⦁	Ако числото е до 100 включително, бонус точките са 5;
# ⦁	Ако числото е по-голямо от 100, бонус точките са 20% от числото;
# ⦁	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
#
# ⦁	Допълнителни бонус точки (начисляват се отделно от предходните):
# ⦁	За четно число  + 1 т.
# ⦁	За число, което завършва на 5  + 2 т.

points = int(input())

if points <= 100:
    bonus_points = 5
elif points < 1000:
    bonus_points = points * 0.20
elif points > 1000:
    bonus_points = points * 0.10

if points % 2 == 0:
    extra_points = 1
elif points % 5 == 0:
    extra_points = 2
else:
    extra_points = 0

print(bonus_points + extra_points)
print(points + extra_points + bonus_points)
