
# Учебната година вече е започнала и отговорничката на 10Б клас -
# Ани трябва да купи определен брой пакетчета с химикали, пакетчета с маркери,
# както и препарат за почистване на дъска.
# Тя е редовна клиентка на една книжарница,
# затова има намаление за нея, което представлява някакъв процент от общата сума.
# Напишете програма, която изчислява колко пари ще трябва да събере Ани,
# за да плати сметката, като имате предвид следния ценоразпис:

# ⦁	Пакет химикали - 5.80 лв.
# ⦁	Пакет маркери - 7.20 лв.
# ⦁	Препарат - 1.20 лв (за литър)

pens = int(input()) * 5.80
markers = int(input()) * 7.20
board_cleaner = int(input()) * 1.20
percent_off = int(input()) / 100

total_price = pens + markers + board_cleaner
money_needed = total_price - (total_price * percent_off)

print(money_needed)
