
# Румен иска да пребоядиса хола и за целта е наел майстори.
# Напишете програма, която изчислява разходите за ремонта.
# За всеки случай, към необходимите материали,
# Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон,
# разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа,
# е равна на 30% от сбора на всички разходи за материали.
#
# ⦁ Tорбички - 0.40
# ⦁	Предпазен найлон - 1.50 лв. за кв. метър
# ⦁	Боя - 14.50 лв. за литър
# ⦁	Разредител за боя - 5.00 лв. за литър

nylon = int(input()) * 1.50
paint = int(input()) * 14.50
thinner = int(input()) * 5.00
work_hours = int(input())

total_paint = paint + (paint * 0.10)
total_nylon = nylon + (2 * 1.50)

total_cost = total_nylon + total_paint + thinner + 0.40
worker_hourly_pay = total_cost * 0.30

grand_total = total_cost + (work_hours * worker_hourly_pay)

print(grand_total)
