#
# За рождения си ден Любомир получил аквариум с формата на паралелепипед.
# Първоначално прочитаме от конзолата на отделни редове размерите му –
# дължина, широчина и височина в сантиметри. Трябва да се пресметне колко литра вода
# ще събира аквариума, ако се знае, че определен процент от вместимостта
# му е заета от пясък, растения, нагревател и помпа.
# Един литър вода се равнява на един кубичен дециметър/ 1л=1 дм3/.
# Да се напише програма, която изчислява литрите вода,
# която са необходими за напълването на аквариума.

length = int(input())
width = int(input())
height = int(input())
percent = float(input()) / 100

liters = (length * width * height) / 1000
liters_needed = liters * (1 - percent)


print(liters_needed)